{
  "recommendations": {
    "title": "Recommendations",
    "viewAllUrl": "https://www.linkedin.com/in/abejaoui/details/recommendations/?detailScreenTabIndex=0",
    "testimonials": [
      {
        "id": 1,
        "name": "Emil Manolov",
        "title": "Software developer",
        "relationship": "Worked on the same team",
        "content": "It was great having Ahmed in our team at Holiday Extras. We were working together on several projects. His strong motivation and great technical knowledge was very beneficial for the team's productivity. Ahmed has a great personality and he would be a great asset to any team."
      },
      {
        "id": 2,
        "name": "Cvetko Parandiev",
        "title": "Full Stack Web Developer at Holiday Extras",
        "relationship": "Worked on the same team",
        "content": "We've worked together on several projects and Ahmed is one of the best people to have as a partner. No matter how tense a meeting, Ahmed made sure everyone left with a smile. He has an excellent knowledge of software and web development, great attitude and mind full of innovative ideas so I strongly recommend him."
      },
      {
        "id": 3,
        "name": "Ahmed Choura",
        "title": "Software Engineer",
        "relationship": "Reported directly to Ahmed Khalil",
        "content": "I'm incredibly grateful for the chance to work closely with Ahmed. He's hands down one of the most knowledgeable Senior Software Engineers I've met. His technical expertise is vast, but what really stands out is how generous he is with his help. No matter the challenge, Ahmed was always ready with a solution and took the time to explain things clearly. His innovative architectural ideas have greatly benefited the company, and he's taught me a lot about managing stress and handling multiple tasks. His positive attitude, problem-solving skills, and collaborative spirit make him truly invaluable. Words can hardly capture how remarkable he is—he's simply amazing!"
      },
      {
        "id": 4,
        "name": "Matthias Simolka",
        "title": "Product Manager @ TWAICE",
        "relationship": "Worked with Ahmed but on different teams",
        "content": "Ahmed is an exceptional senior software engineer with a deep understanding of various different domains. He consistently demonstrated a strong work ethic and took great ownership of projects. Ahmed is a fantastic team player who is always willing to help and mentor junior engineers and teammates from other domains. Ahmed communicated clearly the advantages and drawbacks of different initiatives and ensured high speed and efficiency across the company. His ability to lead and align people across teams is invaluable. Ahmed is also incredibly dedicated and always willing to go the extra mile to ensure project success. His strong problem-solving abilities and attention to detail make him an incredibly valuable asset to any team."
      },
      {
        "id": 5,
        "name": "Amir Duran",
        "title": "Technical Solutions Consultant at Google",
        "relationship": "Worked on the same team",
        "content": "Ahmed is great engineer who tries to resolve problems in elegant and efficient way. I was working together with Ahmed at innosabi GmbH on several projects and it was really pleasure and refreshing to work with person with good technical background and knowledge who wants to attack and solve hard problems. Ahmed just loves technology and lives with it but is a person full with new and brilliant ideas that saves time and money. Ahmed is great asset to every team, he is definitely hard and disciplined worker who wants to get things done. I would recommend him to any company and he would be the person I would like to have in my team too."
      },
      {
        "id": 6,
        "name": "Danijel Hrvacanin",
        "title": "Engineering Manager at instaMotion Gmbh",
        "relationship": "Worked on the same team",
        "content": "Really good engineer and a co-worker. Always thinks how to improve current situation, has great ideas and thinks always in bigger picture. Has good knowledge in different technologies and areas. Always fun and keeps the atmosphere at work relaxed. I wish I could have worked with him longer."
      },
      {
        "id": 7,
        "name": "Vittorio Gissara",
        "title": "Software developer at finway",
        "relationship": "Reported directly to Ahmed",
        "content": "Ahmed is an incredible software engineer to work with. He has the trait of driving everyone forward, teaching and sharing his knowledge to empower junior developers and the company as a whole. Likewise, he has a broad computer science knowledge that allows him to be efficient in many diverse areas like system design, database architecture, cloud systems, mobile development, web development, orchestration & containerization, CI, testing, security, and even usually fully front end positions like design, UX, CEO optimization. A pleasure to work with such a knowledgeable colleague."
      },
      {
        "id": 8,
        "name": "Mohammed Karim Abbes",
        "title": "Software developer at finway",
        "relationship": "Reported directly to Ahmed",
        "content": "I have the privilege to work closely with Ahmed in the same team at finway for more than 2 years. He has great expertise and knowledge in the software engineering field, and he has always shown the will to share it with his colleagues. He has earned everybody's respect through his skills and values. Ahmed will be a valuable asset to any company."
      },
      {
        "id": 9,
        "name": "Daniel Jurkovic",
        "title": "Software developer at innosabi",
        "relationship": "Managed Ahmed directly",
        "content": "I've been closely working together with Ahmed for almost two years. Both on a personal and a professional level it was an amazing journey. What stood out to me was his passion and commitment for high quality results. We shared the joy on coming up with highly reusable technical abstractions with latest technology and bringing them to production in no time. He loves his job and always really cared about our output and the customer's perception. With all his inspiring approaches his work is still a key for the product's success today. I can deeply recommend Ahmed for every senior full stack web development position and would want to work with him together anytime again."
      },
      {
        "id": 10,
        "name": "Anton Demin",
        "title": "Senior Frontend at Cognigy",
        "relationship": "Worked on the same team",
        "content": "Despite we had only one common project at Holiday Extras, Ahmed has proved yourself as an initiative and creative engineer. He always has some ideas on how to improve or optimise the solution or fresh sight on the problem. Combining great tech skills with a positive mindset and energy Ahmed can be an excellent asset to any team."
      },
      {
        "id": 11,
        "name": "Ben Sikasa",
        "title": "UI/UX designer",
        "relationship": "Worked on the same team",
        "content": "It was a great honor to have Ahmed on my development team. With his diligence and his unconventional way of thinking and tackling problems he was a great enrichment for our team. Beyond his professional competence, Ahmed is also a very pleasant and humorous person. It is a great pity that we are currently unable to continue our cooperation."
      },
      {
        "id": 12,
        "name": "Pablo Klemm",
        "title": "Business Manager at Antaes Consulting",
        "relationship": "Worked on the same team",
        "content": "I have had the pleasure of working with Ahmed at innosabi for almost two years. He is a fantastic professional and person. Ahmed values well-done work, he excels at finding the optimal solution to a problem and has the talent of implementing it quickly, he is a very skilled developer. In the team, he always was ready to give a hand or even proactively asked if anyone needed help, he also has a great lot of patience to explain his approaches, this helps the whole team learn. I would work with Ahmed anytime again, his expertise will ensure the success of any software project."
      }
    ]
  }
}
